Windsim_AR/SimpleFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


Uinlet          (10 0 0);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }

    inlet
    {
        
    

    type            atmBoundaryLayerInletVelocity;
    #include        "include/ABLConditions" 
    value           $Uinlet;
    }

    ground
    {
    type slip;
    } 
    
    sides
    {
    type slip;
    }
    top
    {
     type            slip;
     
    }


    depth_img 
    { 
     type            uniformFixedValue;
     uniformValue    (0 0 0);
     value           uniform (0 0 0);
    }
    

}

// ************************************************************************* //
