Windsim_AR/SimpleFoam/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref       10 ;
Zref       10 ;
zDir (0 0 1);
flowDir (-1 0 0);
z0 uniform 0.1 ;
zGround uniform -117.68388 ;


// ************************************************************************* //
