Windsim_AR/SimpleFoam/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
 #include        "include/ABLConditions" 
    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

 ground
    {
    type slip;
    } 

    sides
    {
    type slip;
    }

    top
    {
        type slip;
    }  


    depth_img
    {
       type            nutkAtmRoughWallFunction;
        z0              $z0;
        value           uniform 0.0;
       


    }
    

    
}

// ************************************************************************* //
