Windsim_AR/SimpleFoam/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| ========= | |
| \\ / F ield | OpenFOAM: The Open Source CFD Toolbox |
| \\ / O peration | Version: 2.1.1 |
| \\ / A nd | Web: www.OpenFOAM.org |
| \\/ M anipulation | |
\*---------------------------------------------------------------------------*/
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap true;
addLayers true;
// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    depth_img.stl
    {
    type triSurfaceMesh;
    scale 1; 
    name depth_img;
    }


};
// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    maxLocalCells 1000000;  
    maxGlobalCells 2000000;
    minRefinementCells 100; 
    resolveFeatureAngle 42;
    nCellsBetweenLevels 10; 
    features
    (
    );
    refinementSurfaces
        {
        depth_img
        {
        // Surface-wise min and max refinement level
        level (1 1);
        }
}
refinementRegions
{
refinementBox
{
mode inside;
levels ((1E15 4));
}
}
 locationInMesh (0.123 0.423423432 5.1321124);
allowFreeStandingZoneFaces true;
}
snapControls
{
    nSmoothPatch 4;
    nSolveIter 30;
    tolerance           4.0; 
    nRelaxIter 4;
    explicitFeatureSnap    true;
    implicitFeatureSnap    false;    
}
// Settings for the layer addition.
addLayersControls
{
    relativeSizes       true;
    featureAngle 90;
    nGrow 0;
    nBufferCellsNoExtrude 0;
    nRelaxIter            3;
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
    maxFaceThicknessRatio 0.5;
    nLayerIter 10;
}
addLayersControls
{
    layers
    {
        depth_img.stl
        {
            nSurfaceLayers 1;
        }
    }
    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 1;
    minThickness        1e-3;
}
meshQualityControls
{
maxNonOrtho 65;
maxConcave 180; // 180 to disable 
maxBoundarySkewness 20;
maxInternalSkewness 4;
minVol 1e-13;
minTetQuality 1e-30; // <0 disable 
minArea -1; // < 0 disable
minTwist 0.02; // <0 disable 
minDeterminant 0.001; // 1 = hex 
minFaceWeight 0.02;
minVolRatio 0.01; //- minVolRatio (0 -> 1)

minTriangleTwist -1; //>0 for Fluent compatibility


nSmoothScale 2;
//- amount to scale back displacement at error points
errorReduction 0.75;

}
writeFlags
(
    
);
mergeTolerance 1e-3;
